Revit 2027 API
GroupTypeId.ConceptualEnergyData Property
 Conceptual Energy Data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConceptualEnergyData { get; }
Public Shared ReadOnly Property ConceptualEnergyData As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConceptualEnergyData {
	ForgeTypeId^ get ();
}
static member ConceptualEnergyData : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace